#!/usr/bin/env bash
#
# Делает снапшот LVM-тома /dev/ol/pglv, а старые
# (оставляем только KEEP штук последних) удаляет.
#
# Запускать от root:  sudo ./add_wheel_users.sh
#
# ПЕРЕД СТАРТОМ: при необходимости поправьте переменные в секции «НАСТРОЙКИ»

set -e

#──────────────────────────
# НАСТРОЙКИ (редактируйте)
#──────────────────────────
VG="ol"          # volume group
LV="pglv"        # исходный LV
SNAP_SIZE="1G"   # размер CoW-области (подберите!)
KEEP=14          # сколько снапшотов оставляем (14 = 7 суток)
PG_MOUNT="/var/lib/pgsql" # точка монтирования PostgreSQL-данных

DATE=$(date +%Y%m%d%H%M) # формируем метку времени
SNAP_NAME="${LV}_snap_${DATE}" # имя будущего снапшота.

# ──────────────────────────────
# Шаг 0. Требования запустить от root
# ──────────────────────────────
require_root() {
  [[ $(id -u) -eq 0 ]] || { echo "Запустите скрипт от root!"; exit 1; }
}

# ──────────────────────────────
# Шаг 1. Заморозка файловой системы
# ──────────────────────────────
echo "[$(date)] Freeze $PG_MOUNT"
fsfreeze -f "$PG_MOUNT"

# ──────────────────────────────
# Шаг 2. Создание снапшота
# ──────────────────────────────
echo "[$(date)] Create snapshot $SNAP_NAME"
/sbin/lvcreate -L "$SNAP_SIZE" -s -n "$SNAP_NAME" "/dev/$VG/$LV"

# ──────────────────────────────
# Шаг 3. Разморозка файловой системы
# ──────────────────────────────
echo "[$(date)] Unfreeze $PG_MOUNT"
fsfreeze -u "$PG_MOUNT"

# ──────────────────────────────
# Шаг 4. Формирование списка устаревших снапшотов
# ──────────────────────────────
snaps=()

while read -r lvname; do
    lvname=${lvname##* }      # срезаем пробелы слева
    [[ $lvname =~ ^${LV}_snap_ ]] && snaps+=("$lvname")
done < <(lvs --noheadings -o lv_name "/dev/$VG")

# сортировка
IFS=$'\n' snaps=($(sort -r <<<"${snaps[*]}"))
unset IFS

# берём старые, которые после KEEP по счету
OLD_SNAPS=("${snaps[@]:$KEEP}")

# ──────────────────────────────
# Шаг 5. Удаление старых снапшотов
# ──────────────────────────────
for S in "${OLD_SNAPS[@]}"; do
  echo "[$(date)] Remove old snapshot $S"
  /sbin/lvremove -f "/dev/$VG/$S"
done

# конец
echo "[$(date)] Done"
